app/views/carriers/_destination_table.html.erb

      <tr>
        <td> <%= link_to Carrier.find(id).name, Carrier.find(id) %> </td>
---
SELECT  "carriers".* FROM "carriers" WHERE "carriers"."id" = $1 LIMIT 1  [["id", 50]]