app/controllers/carriers_controller.rb

SELECT  "carriers".* FROM "carriers" WHERE "carriers"."id" = $1 LIMIT 1  [["id", 45]]
---
  def show
    @carrier = Carrier.find(params[:id])

SELECT "carriers".* FROM "carriers"
---
  def index
    @carriers = Carrier.all