app/controllers/home_controller.rb

SELECT  "carriers".* FROM "carriers" WHERE "carriers"."id" = $1 LIMIT 1  [["id", 46]]
---
  def answer
    @delta = Carrier.find(46)